let arrC = new Array;
for (i=0; i<=9; i++) {
    let randA = Math.round(Math.random ()*100);
       arrC[i]=(randA)
    };
  console.log("Объявить массив из 10 элементов и заполнить его случайными числами от 1 до 100:  ",arrC);
  let max = Math.max(...arrC);
  let min = Math.min(...arrC);
  console.log ("Найти максимальное и минимальное значение в массиве");
  console.log("Макс:", max);
   console.log("Мин:", min);
console.log ("...................................................");
console.log ("...................................................");

console.log("Mмассив:  ",arrC);
let firstElement = arrC.shift();
arrC.push(firstElement);

console.log(" Вырезать первый элемент и добавить его в конец массива.:  ",arrC);

console.log ("...................................................");

 console.log ("...................................................");
 console.log ("...................................................");
 console.log ("...................................................");

 let arrA = new Array;
for (i=0; i<=9; i++) {
    let randA = Math.round(Math.random ()*75);
       arrA[i]=(randA)
    };
  console.log("Объявить массив из 10 элементов и заполнить его случайными числами от 1 до 75:  ",arrA);
console.log ("...................................................");


 let maxA = Math.max(...arrA);
let minA = Math.min(...arrA);
console.log ("Найти минимальное и максимальное значение в массиве: ");

console.log("Макс:", maxA);
 console.log("Мин:", minA);
 let summA = maxA + minA;
 console.log("Вывести в консоль их сумму:" + summA);
 console.log ("...................................................");
 console.log ("...................................................");
 console.log ("...................................................");
 console.log ("...................................................");


 let arrB = new Array;
 for (i=0; i<=9; i++) {
     let randA = Math.round(Math.random ()*50);
        arrB[i]=(randA)
     };
   console.log("Объявить массив из 10 элементов и заполнить его случайными числами от 1 до 50:  ",arrB);
 console.log ("...................................................");
 
 let summB = arrB.reduce((acc, curr) => acc + curr, 0);

 console.log("Найти сумму всех элементов массива: " + summB);
  console.log ("...................................................");
  console.log ("...................................................");
  console.log ("...................................................");
  console.log ("...................................................");


 let strA ='Итак, самое длинное научное название: метилпропенилендигидроксициннаменилакрилическая кислота.';
 let arrOfWords = strA.split (' ');
 console.log(arrOfWords);
console.log ("...................................................");


let str2 = "Итак, самое длинное научное название: метилпропенилендигидроксициннаменилакрилическая кислота.";

let words = str2.split(/\s+/);
words.forEach(word => console.log(word));
console.log ("...................................................");
console.log ("...................................................");
console.log ("...................................................");
console.log ("...................................................");
console.log ("...................................................");



let arr5 = new Array;
for (i=0; i<=4; i++) {
    let randA = Math.round(Math.random ()*50);
       arr5[i]=(randA)
    };
    console.log("Объявить массив из 5 элементов и заполнить его любыми числами:  ",arr5);
    console.log ("...................................................");
    
let [num1, num2, num3, num4, num5] = arr5;
console.log ("Присвоить 5 переменным значения из массива с помощью деструктуризации, Выводим значения переменных в консоль:");
console.log("num1:", num1);
console.log("num2:", num2);
console.log("num3:", num3);
console.log("num4:", num4);
console.log("num5:", num5);

console.log ("...................................................");
